**Reading and Writing Data in Text Format**

In [1]:
import pandas as pd
import numpy as np

In [4]:

df = pd.read_csv('./book-support/examples/ex1.csv')

In [6]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table('./book-support/examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
pd.read_csv('./book-support/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [11]:
pd.read_csv('./book-support/examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
names=['a', 'b', 'c', 'd', 'message']
pd.read_csv('./book-support/examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [16]:
parsed = pd.read_csv('./book-support/examples/csv_mindex.csv',index_col=['key1', 'key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [21]:
result = pd.read_table('./book-support/examples/ex3.csv', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

Because there was one fewer column name than the number of data rows,
read_table infers that the first column should be the DataFrame’s index in this special case.

In [23]:
pd.read_csv('./book-support/examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
result = pd.read_csv('./book-support/examples/ex5.csv')

In [25]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [27]:
result = pd.read_csv('./book-support/examples/ex5.csv', na_values=['NULL'])

In [28]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [31]:
pd.read_csv('./book-support/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

**Reading Text Files in Pieces**

In [32]:
pd.options.display.max_rows = 10

In [33]:
result = pd.read_csv('./book-support/examples/ex6.csv')

In [34]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [37]:
pd.read_csv('./book-support/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [38]:
chunker = pd.read_csv('./book-support/examples/ex6.csv', chunksize=1000)

In [39]:
chunker

In [57]:
chunker = pd.read_csv('./book-support/examples/ex6.csv', chunksize=1000)
tot = pd.Series([], dtype='float64')
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [58]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

**Writing Data to Text Format**

In [59]:
data = pd.read_csv('./book-support/examples/ex5.csv')

In [60]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

Using DataFrame’s to_csv method, we can write the data out to a comma-separated
file:

In [61]:
data.to_csv('./book-support/examples/out.csv')

In [62]:
import sys

data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [63]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [64]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [65]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [66]:
dates = pd.date_range('1/1/2000', periods=7)

In [68]:
ts = pd.Series(np.arange(7), index=dates)

In [69]:
ts.to_csv('./book-support/examples/tseries.csv')

In [72]:
!cat ./book-support/examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

**Working with Delimited Formats**

In [73]:
data = pd.read_csv('./book-support/examples/ex7.csv')

In [76]:
import csv

In [78]:
f = open('./book-support/examples/ex7.csv')

In [79]:
reader = csv.reader(f)

In [80]:
reader

In [81]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [82]:
f.close()

In [94]:
with open('./book-support/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

header, values = lines[0], lines[1:]

In [95]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [96]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [103]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(data_dict, dialect=my_dialect)

In [106]:
reader = csv.reader(data_dict, delimiter='|')

In [98]:
# csvfile = open("testdata.csv", "r")
# table = csv.reader(csvfile)
# for row in table:
#     ws_testdata.append(row)
#     # store what you need in variables
# csvfile.close()

To write delimited files manually, you can use csv.writer. It accepts an open, writa‐
ble file object and the same dialect and format options as csv.reader:

In [107]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

**JSON Data**

 JSON string to Python form, use json.loads:

In [110]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [112]:
import json

result = json.loads(obj)

result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [114]:
asjson = json.dumps(result)

In [115]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [116]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [117]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [120]:
data = pd.read_json('./book-support/examples/example.json')

In [121]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [122]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [123]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

**XML and HTML: Web Scraping**

In [125]:
!pip install lxml

Requirement already satisfied: lxml in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (4.5.0)

In [126]:
!pip install beautifulsoup4 html5lib

Collecting beautifulsoup4
  Using cached beautifulsoup4-4.9.0-py3-none-any.whl (109 kB)
Collecting html5lib
  Downloading html5lib-1.0.1-py2.py3-none-any.whl (117 kB)
Collecting soupsieve>1.2
  Using cached soupsieve-2.0-py2.py3-none-any.whl (32 kB)
Requirement already satisfied: webencodings in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\renat\appdata\roaming\python\python38\site-packages (from html5lib) (1.14.0)
Installing collected packages: soupsieve, beautifulsoup4, html5lib
Successfully installed beautifulsoup4-4.9.0 html5lib-1.0.1 soupsieve-2.0

In [127]:
tables = pd.read_html('./book-support/examples/fdic_failed_bank_list.html')

In [135]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [130]:
failures = tables[0]

In [132]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [133]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [134]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

**Parsing XML with lxml.objectify**

In [136]:
from lxml import objectify

In [139]:
path = './book-support/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [140]:
root.INDICATOR

In [142]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [144]:
perf = pd.DataFrame(data)

In [145]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [146]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [147]:
root

In [148]:
root.get('href')

'http://www.google.com'

In [149]:
root.text

'Google'

**Binary Data Formats**

In [150]:
frame = pd.read_csv('./book-support/examples/ex1.csv')

In [151]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [152]:
frame.to_pickle('./book-support/examples/frame_pickle')

In [154]:
pd.read_pickle('./book-support/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Using HDF5 Format**

In [156]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [160]:
# !pip install tables
store = pd.HDFStore('mydata.h5')

In [161]:
store['obj1'] = frame

In [162]:
store['obj1_col'] = frame['a']

In [163]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [164]:
store['obj1']

           a
0  -0.378819
1   1.780763
2   0.881294
3   0.788977
4  -1.161805
..       ...
95 -0.580444
96  0.634632
97 -1.194351
98  0.653023
99 -0.188639

[100 rows x 1 columns]

In [166]:
store.put('obj2', frame, format='table')

In [167]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.379079
11  0.713417
12  0.933226
13  1.182443
14  0.809477
15  1.338098

In [179]:
store.close()

In [183]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
# hdf = pd.HDFStore('mydata.h5', 'r')

In [184]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.378819
1  1.780763
2  0.881294
3  0.788977
4 -1.161805

In [181]:
import tables
tables.file._open_files.close_all()

Closing remaining open files:mydata.h5...done

If you work with large quantities of data locally, I would encourage you to explore
PyTables and h5py to see how they can suit your needs. Since many data analysis
problems are I/O-bound (rather than CPU-bound), using a tool like HDF5 can mas‐
sively accelerate your applications.

HDF5 is not a database. It is best suited for write-once, read-many
datasets. While data can be added to a file at any time, if multiple
writers do so simultaneously, the file can become corrupted.

**Reading Microsoft Excel Files**

In [187]:
!pip install xlrd openpyxl

Collecting xlrd
  Downloading xlrd-1.2.0-py2.py3-none-any.whl (103 kB)
Collecting openpyxl
  Downloading openpyxl-3.0.3.tar.gz (172 kB)
Collecting jdcal
  Downloading jdcal-1.4.1-py2.py3-none-any.whl (9.5 kB)
Collecting et_xmlfile
  Downloading et_xmlfile-1.0.1.tar.gz (8.4 kB)
Building wheels for collected packages: openpyxl, et-xmlfile
  Building wheel for openpyxl (setup.py): started
  Building wheel for openpyxl (setup.py): finished with status 'done'
  Created wheel for openpyxl: filename=openpyxl-3.0.3-py2.py3-none-any.whl size=241264 sha256=9ae54737deda0898a7a6de3298a0939f717cc19413fd191d49c0e9f18e9f6ea5
  Stored in directory: c:\users\renat\appdata\local\pip\cache\wheels\34\21\39\70d175b8eb9f953ff614f6881346cf556226951d79e4163a32
  Building wheel for et-xmlfile (setup.py): started
  Building wheel for et-xmlfile (setup.py): finished with status 'done'
  Created wheel for et-xmlfile: filename=et_xmlfile-1.0.1-py3-none-any.whl size=8920 sha256=f607683bc6d054d631b9c7ad064e01754bd67a3f18039c285d75a45e58c13e7a
  Stored in directory: c:\users\renat\appdata\local\pip\cache\wheels\6e\df\38\abda47b884e3e25f9f9b6430e5ce44c47670758a50c0c51759
Successfully built openpyxl et-xmlfile
Installing collected packages: xlrd, jdcal, et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.0.1 jdcal-1.4.1 openpyxl-3.0.3 xlrd-1.2.0

In [188]:
xlsx = pd.ExcelFile('./book-support/examples/ex1.xlsx')

In [189]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

If you are reading multiple sheets in a file, then it is faster to create the ExcelFile,
but you can also simply pass the filename to pandas.read_excel:

In [190]:
frame = pd.read_excel('./book-support/examples/ex1.xlsx', 'Sheet1')

In [191]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

To write pandas data to Excel format, you must first create an ExcelWriter, then
write data to it using pandas objects’ to_excel method:

In [194]:
writer = pd.ExcelWriter('./book-support/examples/ex2.xlsx')

In [195]:
frame.to_excel(writer, 'Sheet1')

writer.save()

In [196]:
frame.to_excel('./book-support/examples/ex2.xlsx')

**Interacting with Web APIs**

In [197]:
import requests

In [198]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [199]:
resp = requests.get(url)

In [200]:
resp

In [201]:
data = resp.json()

In [211]:
data[0]['title']

'DEPR: deprecate Index.__getitem__ with float key'

In [212]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [213]:
issues

,number,title,labels,state
0,34193,DEPR: deprecate Index.__getitem__ with float key,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
1,34192,PERF: Remove unnecessary copies in sorting fun...,[],open
2,34191,DEPR: deprecate Index.__getitem__ with float key,"[{'id': 1741841389, 'node_id': 'MDU6TGFiZWwxNz...",open
3,34188,BUG: pandas.read_excel creates a DataFrame wit...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,34187,CLN: deduplicate __setitem__ and _reduce on ma...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
...,...,...,...,...
25,34150,CI: Linting errors from flake >= 3.8.1,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
26,34149,CI: Moving ARM64 build from allowed failures,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
27,34145,"REF: separate to_time, avoid runtime imports","[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
28,34142,May 2020 Dev Meeting,[],open
29,34141,Incorrect multi-index specific level sorting a...,[],open

 **Interacting with Databases**

In [214]:
import sqlite3

In [215]:
query = """
         CREATE TABLE test
         (a VARCHAR(20),
          b VARCHAR(20),
          c REAL,
          d INTEGER);
        """

In [216]:
con = sqlite3.connect('mydata.sqlite')

In [218]:
con

In [217]:
con.execute(query)

In [219]:
con.commit()

In [221]:
data = [('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [222]:
data

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [223]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [224]:
stmt

'INSERT INTO test VALUES(?, ?, ?, ?)'

In [225]:
con.executemany(stmt, data)

In [226]:
con.commit()

In [230]:
cursor = con.execute('select * from test')

In [232]:
rows = cursor.fetchall()

In [233]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [234]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [235]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [3]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.3.17-cp38-cp38-win_amd64.whl (1.2 MB)
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.17

In [4]:
import sqlalchemy as sqla

In [5]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [6]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5